
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьНастройки();
	УправлениеВидимостьюFTP();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
	ПоказатьПредупреждение(, "Настройки сохранены", 5, "АРМ ЭДО");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТранспортОбменаПриИзменении(Элемент)
	УправлениеВидимостьюFTP();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНастройки()

	Настройки = ЭАрМ_НастройкиСервер.ПолучитьВсеНастройки();
	АдресСервисаДалион = Настройки.АдресСервисаДалион;
	ТранспортОбмена = Настройки.ТранспортОбмена;
	ИспользоватьАвтоОтправку = Настройки.ИспользоватьАвтоОтправку;
	ЛогироватьСобытия = Настройки.ЛогироватьСобытия;
	FTP_Сервер = Настройки.FTP_Сервер;
	FTP_Порт = Настройки.FTP_Порт;
	FTP_Пользователь = Настройки.FTP_Пользователь;
	FTP_Пароль = Настройки.FTP_Пароль;
	FTP_Каталог = Настройки.FTP_Каталог;
	ПапкаОбмена = Настройки.ПапкаОбмена;

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()

	Настройки = Новый Структура;
	Настройки.Вставить("АдресСервисаДалион", АдресСервисаДалион);
	Настройки.Вставить("ТранспортОбмена", ТранспортОбмена);
	Настройки.Вставить("ИспользоватьАвтоОтправку", ИспользоватьАвтоОтправку);
	Настройки.Вставить("ЛогироватьСобытия", ЛогироватьСобытия);
	Настройки.Вставить("FTP_Сервер", FTP_Сервер);
	Настройки.Вставить("FTP_Порт", FTP_Порт);
	Настройки.Вставить("FTP_Пользователь", FTP_Пользователь);
	Настройки.Вставить("FTP_Пароль", FTP_Пароль);
	Настройки.Вставить("FTP_Каталог", FTP_Каталог);
	Настройки.Вставить("ПапкаОбмена", ПапкаОбмена);

	ЭАрМ_НастройкиСервер.СохранитьВсеНастройки(Настройки);

КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюFTP()
	Элементы.ГруппаFTP.Видимость = (ТранспортОбмена = "FTP");
	Элементы.ГруппаПапка.Видимость = (ТранспортОбмена = "Папка");
КонецПроцедуры

#КонецОбласти
