
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьНастройки();
	УправлениеВидимостьюГрупп();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
	ПоказатьПредупреждение(, "Настройки сохранены", 5, "АРМ ЭДО");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТранспортОбменаПриИзменении(Элемент)
	УправлениеВидимостьюГрупп();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНастройки()

	Попытка
		Настройки = ЭАрМ_НастройкиСервер.ПолучитьВсеНастройки();
		АдресСервисаДалион = Настройки.АдресСервисаДалион;
		ТранспортОбмена = Настройки.ТранспортОбмена;
		ИспользоватьАвтоОтправку = Настройки.ИспользоватьАвтоОтправку;
		ЛогироватьСобытия = Настройки.ЛогироватьСобытия;
		FTP_Сервер = Настройки.FTP_Сервер;
		FTP_Порт = Настройки.FTP_Порт;
		FTP_Пользователь = Настройки.FTP_Пользователь;
		FTP_Пароль = Настройки.FTP_Пароль;
		FTP_Каталог = Настройки.FTP_Каталог;
		ПапкаОбмена = Настройки.ПапкаОбмена;
		ТестовыйРежим = Настройки.ТестовыйРежим;
		СБИС_ИспользоватьСБИС = Настройки.СБИС_ИспользоватьСБИС;
		СБИС_ЛогинСБИС = Настройки.СБИС_ЛогинСБИС;
		СБИС_ПарольСБИС = Настройки.СБИС_ПарольСБИС;
	Исключение
		// Настройки ещё не записаны
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()

	Настройки = Новый Структура;
	Настройки.Вставить("АдресСервисаДалион", АдресСервисаДалион);
	Настройки.Вставить("ТранспортОбмена", ТранспортОбмена);
	Настройки.Вставить("ИспользоватьАвтоОтправку", ИспользоватьАвтоОтправку);
	Настройки.Вставить("ЛогироватьСобытия", ЛогироватьСобытия);
	Настройки.Вставить("FTP_Сервер", FTP_Сервер);
	Настройки.Вставить("FTP_Порт", FTP_Порт);
	Настройки.Вставить("FTP_Пользователь", FTP_Пользователь);
	Настройки.Вставить("FTP_Пароль", FTP_Пароль);
	Настройки.Вставить("FTP_Каталог", FTP_Каталог);
	Настройки.Вставить("ПапкаОбмена", ПапкаОбмена);
	Настройки.Вставить("ТестовыйРежим", ТестовыйРежим);
	Настройки.Вставить("СБИС_ИспользоватьСБИС", СБИС_ИспользоватьСБИС);
	Настройки.Вставить("СБИС_ЛогинСБИС", СБИС_ЛогинСБИС);
	Настройки.Вставить("СБИС_ПарольСБИС", СБИС_ПарольСБИС);

	ЭАрМ_НастройкиСервер.СохранитьВсеНастройки(Настройки);

КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюГрупп()
	Элементы.ГруппаFTP.Видимость = (ТранспортОбмена = "FTP");
	Элементы.ГруппаПапка.Видимость = (ТранспортОбмена = "Папка");
КонецПроцедуры

#КонецОбласти
