
// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
//   Структура - сведения о внешней обработке
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование", "АРМ Панель управления ЭДО");
	ПараметрыРегистрации.Вставить("Версия", "1.0.0");
	ПараметрыРегистрации.Вставить("Информация", "Панель управления обменом ЭДО между УТ и Далион");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление");
	Команды.Колонки.Добавить("Идентификатор");
	Команды.Колонки.Добавить("Использование");
	Команды.Колонки.Добавить("ПоказыватьОповещение");
	Команды.Колонки.Добавить("Модификатор");
	
	Команда = Команды.Добавить();
	Команда.Представление = "Открыть панель управления ЭДО";
	Команда.Идентификатор = "ОткрытьПанельУправленияЭДО";
	Команда.Использование = "ОткрытиеФормы";
	Команда.ПоказыватьОповещение = Истина;
	Команда.Модификатор = "";
	
	ПараметрыРегистрации.Вставить("Команды", Команды);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции
